<?php
/**
 * Завдання 1
 */
/**
 * Напишіть програму, яка виводить всі числа від 1 до 100, з двома винятками.
 * Для чисел, які діляться на 3 без остачі, потрібно вивести 'Alpha', а для чисел, що діляться на 5
 * (але не на 3) - 'Beta'.
 *
 * Коли зумієте - виправте її так, щоб вона виводила «Alpha & Beta» для всіх чисел, які діляться і на 3,
 * і на 5.
 */



for ($i = 1; $i<=100; $i++) {

if ((($i%5) == 0) && (($i%3) == 0)) {
        echo $i,  " mod5 ", ($i%5), " mod3 ", ($i%3) , " Alpha & Betta<br>";
    }
elseif ((($i%5) == 0) && (($i%3) != 0)) {
        echo $i,  " mod5 ", ($i%5), " mod3 ", ($i%3) , " Betta<br>";
    }
elseif(($i%3) == 0) {
    echo $i, " mod5 ", ($i%5), " mod3 ", ($i%3) , " Alpha<br>";
}
    else {
        echo $i,  " mod5 ", ($i%5), " mod3 ", ($i%3) , "<br>";
    }

//    echo "$i    ", (($i%3) === 0 ? "Alpha" : );
//    echo $x,"- ", (($x%) === 0 ? "Alpha" ), " - ";



}


?>