<pre>
<?php

/**
 * Завдання 4
 */
/**
 * У користувача онлайн сервісу є 2000 у.о., проімітуйте здійснення покупок, використовуючи рандомні
 * значення rand(), при цьому потрібно виводити залишок на рахунку; у разі недостатньої суми на рахунку
 * виведіть повідомлення. Використовувати Do-While або While.
 */

$bablo = 2000;

$i = 1;

while ($bablo >= 0) {

    $pokupka = rand(1, 2000);

    if ($bablo >= $pokupka) {
        echo "Покупка #$i<br>";
        echo "Баланс перед покупкой: $bablo<br>";
        echo "Цена товара: $pokupka<br>";
        $bablo -= $pokupka;
        echo "Баланс счета после покупки: $bablo<br><br><br>";
        $i++;
    }
    else {
        echo "Покупка #$i<br>";
        echo "На вашем счете недостаточно денег!!!!<br>";
        echo "Цена товара: $pokupka<br>";
        echo "Текущий баланс: $bablo<br>";
        echo "Bye!!! Loser!!!<br>";
        break;
    }

}


?>








</pre>
