<pre>
<?php

/**
 * Завдання 5
 */
/**
 * Створіть масив з назвами усіх місяців року.
 * Використовуючи цикл або цикл із switch-case виведіть номер місяця і його назву.
 */



$month = [
    '',
    'Январь',
    'Февраль',
    'Март',
    'Апрель',
    'Май',
    'Июнь',
    'Июль',
    'Август',
    'Сентябрь',
    'Октябрь',
    'Ноябрь',
    'Декабрь',
];

echo "<br>";

print_r($month);

echo "<br><hr><br>";

unset($month[0]);

print_r($month);

echo "<br><hr><br>";

echo "#Месяца", " => ", "Месяц<br>";

foreach ($month as $index => $value) {

    echo $index, " => ", $value, "<br>";

}





?>
</pre>
